[
  {
    "index": 1,
    "productCode": "119085P1",
    "title": "Dolphin Catamaran Snorkel and Sail with Open Bar ",
    "descriptionExcerpt": "Enjoy a delightful 3-hour adventure featuring two captivating snorkeling stops. First, explore the iconic shipwreck \"Antilla\", a fascinating relic resting beneath the azure waters,...",
    "reviewCount": 2382,
    "rating": 4.7418137,
    "supplier": "Delphi Watersports"
  },
  {
    "index": 2,
    "productCode": "2785MORSNORKEL",
    "title": "Half-Day Snorkel Sail Tour with Caribbean Lunch",
    "descriptionExcerpt": "Who doesn't want to spend half the day on Aruba's gorgeous turquoise waters? This 4-hour sail includes snorkel gear and visits to three snorkel spots: The Antilla shipwreck, Catali...",
    "reviewCount": 720,
    "rating": 4.759722,
    "supplier": "Red Sail Sports - Aruba"
  },
  {
    "index": 3,
    "productCode": "6593P7",
    "title": "Luxury Lagoon Cruise with Onboard Chef and Signature Cocktails",
    "descriptionExcerpt": "The Luxury Lagoon Cruise allows you to cruise along Aruba’s Southern Coast aboard our Teak Schooner. While cruising, join us by the bar for a cool refreshment or lay down on one of...",
    "reviewCount": 248,
    "rating": 4.814516,
    "supplier": "Pelican Aruba"
  },
  {
    "index": 4,
    "productCode": "8936P1",
    "title": "Arusun Catamaran Sail with Snorkeling in Aruba",
    "descriptionExcerpt": "Have a warm Aruban welcome on board of a beautiful 65-foot catamaran, the Arusun, and spend the most fun, relaxing 2.5 hours exploring the Caribbean Sea. There is no better way to ...",
    "reviewCount": 2451,
    "rating": 4.8408813,
    "supplier": "Aruba Watersports Center"
  },
  {
    "index": 5,
    "productCode": "444239P8",
    "title": "Tropical Sailing Experience with BBQ Lunch or BBQ Dinner in Aruba",
    "descriptionExcerpt": "Discover Aruba's Beauty Embark on the Tropical Sailing Experience from Varadero Marina Aruba, with morning and afternoon sails available. Cruise past the picturesque Spanish Lagoon...",
    "reviewCount": 174,
    "rating": 4.8965516,
    "supplier": "Tropical Sailing Aruba"
  },
  {
    "index": 6,
    "productCode": "47607P3",
    "title": "Premium Catamaran Morning Sail: Snorkeling, Mimosas and Brunch",
    "descriptionExcerpt": "Begin your day with freshly prepared appetizers, refreshing juice, and a sparkling mimosa as you set sail on the crystal-clear waters of the Caribbean. Welcome aboard Octopus, wher...",
    "reviewCount": 597,
    "rating": 4.670017,
    "supplier": "Octopus Snorkeling, Sailing & Sunset Tours - Private Charter - Boat Rental"
  },
  {
    "index": 7,
    "productCode": "47607P2",
    "title": "Premium Catamaran Afternoon Sail: Snorkeling and Lunch",
    "descriptionExcerpt": "Your afternoon adventure begins with delicious lunch appetizers, refreshing beverages, and a sparkling toast as you set sail on the Caribbean’s warm, clear blue waters. Our friendl...",
    "reviewCount": 540,
    "rating": 4.748148,
    "supplier": "Octopus Snorkeling, Sailing & Sunset Tours - Private Charter - Boat Rental"
  },
  {
    "index": 8,
    "productCode": "37387P3",
    "title": "Aruba Jolly Pirate Afternoon Sail with Snorkeling",
    "descriptionExcerpt": "Enjoy an afternoon snorkeling cruise in Aruba aboard this 85-foot teak Schooner. Visit three great sites: Malmok Reefs, Boca Catalina and the WWII shipwreck, Antilla! You can choos...",
    "reviewCount": 488,
    "rating": 4.625,
    "supplier": "Jolly Pirates Sailing Cruises & Snorkeling"
  },
  {
    "index": 9,
    "productCode": "2785AFTSNORKEL",
    "title": "Antilla Shipwreck and Catalina Bay Snorkel Sail",
    "descriptionExcerpt": "Sun, sailing and snorkeling — the perfect way to spend an afternoon in Aruba. On this 3-hour tour, cruise the Caribbean waters aboard a catamaran and kick your fins to explore two ...",
    "reviewCount": 468,
    "rating": 4.6068377,
    "supplier": "Red Sail Sports - Aruba"
  },
  {
    "index": 10,
    "productCode": "6593P8",
    "title": "Iconic Aruba Sail and Snorkel Experience",
    "descriptionExcerpt": "Experience the joy of sailing along Aruba’s stunning beaches on a spacious catamaran & snorkeling at the marine sanctuary, Catalina bay, and the famous Antilla shipwreck. This tour...",
    "reviewCount": 452,
    "rating": 4.7942476,
    "supplier": "Pelican Aruba"
  }
]